/*
Задача 13: Напишите программу, которая выводит
третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5
78 -> третьей цифры нет
32679 -> 6
*/

// int GetNumber()
// {
//   Console.WriteLine("Введите число");
//   int number = Convert.ToInt32(Console.ReadLine());
//   return number;
// }

// int firstNumber = GetNumber();
// int secondNumber = GetNumber();

// if (secondNumber % firstNumber == 0)
// {
//   Console.WriteLine("Второе число кратно первому");
// }
// else
// {
//   Console.WriteLine($"Второе число НЕ кратно первому, остаток {secondNumber % firstNumber}");
// }