/*
Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет
*/

// int GetNumber()
// {
//   Console.WriteLine("Введите число");
//   int number = Convert.ToInt32(Console.ReadLine());
//   return number;
// }

// int num1 = GetNumber();
// int num2 = GetNumber();

// if (num1 == num2 * num2 || num2 == num1 * num1)
// {
//   Console.WriteLine($"{num1}, {num2} -> Да");
// }
// else
// {
//   Console.WriteLine($"{num1}, {num2} -> Нет");
// }